from string import Template


#### RAG PROMPTS ####


#### System ####

system_prompt = Template("\n".join([
    "أنت مساعد مسؤول عن إنشاء إجابة مناسبة للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة باستفسار المستخدم.",
    "يجب أن تكون إجابتك مبنية على المستندات المقدمة فقط.",
    "تجاهل أي مستندات غير مرتبطة باستفسار المستخدم.",
    "إذا لم تتمكن من العثور على إجابة مناسبة داخل المستندات، أخبر المستخدم بذلك بوضوح.",
    "يجب أن تكون الإجابة بنفس لغة استفسار المستخدم.",
    "كن مهذبًا ومحترمًا في الرد.",
    "اجعل إجابتك دقيقة ومختصرة وتجنب المعلومات غير الضرورية.",
]))


#### Document ####

document_prompt = Template(
    "\n".join([
        "## رقم المستند: $doc_num",
        "### المحتوى: $chunk_text",
    ])
)


#### Footer ####

footer_prompt = Template("\n".join([
    "اعتمادًا فقط على المستندات المذكورة أعلاه، قم بإنشاء إجابة مناسبة للمستخدم.",
    "## السؤال:",
    "$query",
    "",
    "## الإجابة:",
]))